app/Http/Controllers/Admin/PublicController.php

    public function checkLogin(Request $request)
    {
        $this->validate($request, [
            'username' => 'required|min:3|max:20',
            'password' => 'required|min:6|max:32',
            'captcha' => 'required|size:5',
        ]);
        //验证用户账号的合法性（查询数据库）
        $data = $request -> only('username','password');
//        p($data);
        $result = Auth::guard('admin')->attempt($data,$request->get('online'));
---
select * from `admin` where `username` = 'admin' limit 1